; domain
; ==========================================================
; DOMAIN: SATELLITE
;
; Il satellite può:
;   - ruotare
;   - fotografare oggetti
;   - inviare immagini
;
; Vincoli modellati:
;   - orientamento
;   - memoria
;   - slot immagini
;   - qualità HD / SD
;
; Compatibile con Fast Downward
;
; ==========================================================

(define (domain satellite)

(:requirements
    :strips
    :typing
    :negative-preconditions
)

; ==========================================================
; TIPI

(:types
    direction
    object
)

; ==========================================================
; PREDICATI


(:constants
    N NE E SE S SW W NW - direction
)

(:predicates

    ; orientamento corrente
    (pointing ?d - direction)

    ; oggetto visibile da una direzione
    (visible ?o - object ?d - direction)

    ; foto salvata in memoria
    (stored ?o - object)

    ; foto inviata alla Terra
    (sent ?o - object)

    ; qualità richiesta
    (hd ?o - object)
    (sd ?o - object)

    ; memoria disponibile
    (memory-free)

    ; slot disponibile
    (slot-free)
)

; ==========================================================
; ROTAZIONE DESTRA


(:action rotate-right

    :parameters (?from - direction ?to - direction)

    :precondition
    (pointing ?from)

    :effect
    (and
        (not (pointing ?from))
        (pointing ?to)
    )
)

; ==========================================================
; ROTAZIONE SINISTRA

(:action rotate-left

    :parameters (?from - direction ?to - direction)

    :precondition
    (pointing ?from)

    :effect
    (and
        (not (pointing ?from))
        (pointing ?to)
    )
)

; ==========================================================
; FOTO HD

(:action take-picture-hd

    :parameters (?o - object ?d - direction)

    :precondition
    (and
        (pointing ?d)
        (visible ?o ?d)

        (hd ?o)

        (not (stored ?o))
        (not (sent ?o))

        (memory-free)
        (slot-free)
    )

    :effect
    (and
        (stored ?o)

        (not (memory-free))
        (not (slot-free))
    )
)

; ==========================================================
; FOTO SD

(:action take-picture-sd

    :parameters (?o - object ?d - direction)

    :precondition
    (and
        (pointing ?d)
        (visible ?o ?d)

        (sd ?o)

        (not (stored ?o))
        (not (sent ?o))

        (memory-free)
        (slot-free)
    )

    :effect
    (and
        (stored ?o)

        (not (memory-free))
        (not (slot-free))
    )
)

; ==========================================================
; INVIO HD

(:action send-hd

    :parameters (?o - object ?north - direction)

    :precondition
    (and
        (pointing ?north)

        (stored ?o)
        (hd ?o)
    )

    :effect
    (and
        (not (stored ?o))
        (sent ?o)

        (memory-free)
        (slot-free)
    )
)

; ==========================================================
; INVIO SD

(:action send-sd

    :parameters (?o - object ?north - direction)

    :precondition
    (and
        (pointing ?north)

        (stored ?o)
        (sd ?o)
    )

    :effect
    (and
        (not (stored ?o))
        (sent ?o)

        (memory-free)
        (slot-free)
    )
)

)

; problem
; ==========================================================
; PROBLEM EXTREME
; ==========================================================

(define (problem satellite-extreme)

(:domain satellite)

; ==========================================================
; OGGETTI

(:objects

    N E S W NE NW SE SW - direction

    star1 planet1 galaxy1 nebula1
    debris1 dust2 junk3 noise3 - object
)

; ==========================================================
; STATO INIZIALE

(:init

    ; orientamento iniziale
    (pointing N)

    ; risorse
    (memory-free)
    (slot-free)

    ; visibilità
    (visible star1 SE)
    (visible debris1 SE)

    (visible planet1 SW)
    (visible dust2 SW)

    (visible galaxy1 NE)
    (visible junk3 NE)

    (visible nebula1 W)
    (visible noise3 W)

    ; qualità immagini
    (hd star1)
    (sd planet1)

    (hd galaxy1)
    (sd nebula1)
)

; ==========================================================
; GOAL

(:goal
    (and
        (sent star1)
        (sent planet1)
        (sent galaxy1)
        (sent nebula1)
    )
)

)

; plan
1. (rotate-right n ne)
   deleted: (pointing n)
   added: (pointing ne)
   goals met: 0 of 4
2. (take-picture-hd galaxy1 ne)
   deleted: (memory-free) (slot-free)
   added: (stored galaxy1)
   goals met: 0 of 4
3. (rotate-left ne n)
   deleted: (pointing ne)
   added: (pointing n)
   goals met: 0 of 4
4. (send-hd galaxy1 n)
   deleted: (stored galaxy1)
   added: (sent galaxy1) (memory-free) (slot-free)
   goals met: 1 of 4
5. (rotate-left n nw)
   deleted: (pointing n)
   added: (pointing nw)
   goals met: 1 of 4
6. (rotate-left nw w)
   deleted: (pointing nw)
   added: (pointing w)
   goals met: 1 of 4
7. (take-picture-sd nebula1 w)
   deleted: (memory-free) (slot-free)
   added: (stored nebula1)
   goals met: 1 of 4
8. (rotate-right w nw)
   deleted: (pointing w)
   added: (pointing nw)
   goals met: 1 of 4
9. (rotate-right nw n)
   deleted: (pointing nw)
   added: (pointing n)
   goals met: 1 of 4
10. (send-sd nebula1 n)
   deleted: (stored nebula1)
   added: (sent nebula1) (memory-free) (slot-free)
   goals met: 2 of 4
11. (rotate-right n ne)
   deleted: (pointing n)
   added: (pointing ne)
   goals met: 2 of 4
12. (rotate-right ne e)
   deleted: (pointing ne)
   added: (pointing e)
   goals met: 2 of 4
13. (rotate-right e se)
   deleted: (pointing e)
   added: (pointing se)
   goals met: 2 of 4
14. (take-picture-hd star1 se)
   deleted: (memory-free) (slot-free)
   added: (stored star1)
   goals met: 2 of 4
15. (rotate-left se e)
   deleted: (pointing se)
   added: (pointing e)
   goals met: 2 of 4
16. (rotate-left e ne)
   deleted: (pointing e)
   added: (pointing ne)
   goals met: 2 of 4
17. (rotate-left ne n)
   deleted: (pointing ne)
   added: (pointing n)
   goals met: 2 of 4
18. (send-hd star1 n)
   deleted: (stored star1)
   added: (sent star1) (memory-free) (slot-free)
   goals met: 3 of 4
19. (rotate-left n nw)
   deleted: (pointing n)
   added: (pointing nw)
   goals met: 3 of 4
20. (rotate-left nw w)
   deleted: (pointing nw)
   added: (pointing w)
   goals met: 3 of 4
21. (rotate-left w sw)
   deleted: (pointing w)
   added: (pointing sw)
   goals met: 3 of 4
22. (take-picture-sd planet1 sw)
   deleted: (memory-free) (slot-free)
   added: (stored planet1)
   goals met: 3 of 4
23. (rotate-right sw w)
   deleted: (pointing sw)
   added: (pointing w)
   goals met: 3 of 4
24. (rotate-right w nw)
   deleted: (pointing w)
   added: (pointing nw)
   goals met: 3 of 4
25. (rotate-right nw n)
   deleted: (pointing nw)
   added: (pointing n)
   goals met: 3 of 4
26. (send-sd planet1 n)
   deleted: (stored planet1)
   added: (sent planet1) (memory-free) (slot-free)
   goals met: 4 of 4
